GROUP_NOT_FOUND = """
گروه مد نظر شما پیدا نشد!
"""

USER_UNAUTHORIZED = """
هویت شما احراز نشده‌است!
لطفا از دستور \authorize
استفاده کنید.
"""

GROUP_REQUEST_ALREADY_EXIST = """
شما برای عضویت در این گروه قبلا درخواست داده‌اید!
لطفا تا تایید مسئول گروه صبر کنید.
"""
GROUP_REQUEST_SUCCESS = """
درخواست عضویت شما با موفقیت ارسال شد!
پس از تایید توسط مسئول گروه، به شما پیام‌های بعدی ارسال خواهد شد.
"""

START_SUCCESS = """
درود!
به بات رایانش خوش اومدی❤️

🔹 کاربری بات
▫️ در حال حاضر، می‌تونی نوشته‌هایی که دوست داری در شماره‌ها یا هر بستر دیگه‌ای از سمت رایانش منتشر بشه رو به‌راحتی برامون بفرستی و به‌دست هیئت تحریریه برسونی. این کار رو می‌تونی به‌صورت شناس یا ناشناس انجام بدی.
▫️ از شنیدن انتقاد، نظر و خصوصا پیشنهاد شما هم همیشه خوشحال می‌شیم :)

🔸 دم‌دستی ولی متن‌باز!
▫️این بات رو کوچولو و دم‌دستی بالا آوردیم که یه ساز و کاری برای جمع‌آوری متن‌ها داشته باشیم. راستی گزارش مشکل و باگ رو فراموش نکن.
▫️خب کدش عمومیه و هر وقت خواستی کانتریبیشونی(!) به پروژه داشته باشی، باگی رو رفع کنی، یا ایده‌ی جدیدی رو پیاده‌سازی کنی، حتما بهمون پیام بده!

🔹 چگونه؟
▫️ کارکرد بات خیلی راحته! هم می‌تونی از دستور /help کمک بگیری و هم هروقت مشکلی پیش اومد با سردبیر در ارتباط باش.

سپاس از بودنت.
🟢 رایانش
"""

USER_NOT_EXIST = """
خوش اومدی! لطفا در ابتدا از \start استفاده کن.
"""

ENTER_NAME = """
لطفا اسم خودت رو وارد کن. اگه نام و نام خانوادگیت باشه که اصلا بهتر!
"""

ENTER_EMAIL = """
لطفا آدرس جیمیل خودت رو بنویس. از این آدرس برای دسترسی دادن به درایو و داک‌ها استفاده می‌کنیم. شاید ایمیلم بدیم بعدا!
"""
EMAIL_INVALID = """
هممم، به‌نظر جیمیلت معتبر نیست. یه بار دیگه تست کن. اگر هم مشکلی هست بهمون اطلاع بده!
"""

USER_AUTH_SUCCESS = """
ایول! الان دیگه اطلاعاتت تکمیله✅
"""
USER_AUTH_ALREADY_EXIST = """
قبلا هویتت رو گفتی. اگه می‌خوای چیزی رو تغییر بدی بهمون مستقیما پیام بده :)
"""

USER_HAS_NO_ACCESS = """
ببخشید ولی شما دسترسی به این دستور رو ندارید!
"""

NO_PENDING_JOIN_REQUESTS = """
درخواست ورود به گروه تاییدنشده‌ای وجود نداره رئیس!
"""

CANCEL_CONVERSATION = """
کنسله.
"""

NO_ACTIVE_GROUP = """
هیچ گروه فعالی وجود نداره.
"""
